7767517
324 391
Input            image            0 1 image 0=96 1=84 2=3
Convolution      conv1_1          1 1 image conv1_1 0=64 1=3 2=1 3=1 4=1 5=1 6=1728
ReLU             relu1_1          1 1 conv1_1 conv1_1_relu1_1
Convolution      conv1_2          1 1 conv1_1_relu1_1 conv1_2 0=64 1=3 2=1 3=1 4=1 5=1 6=36864
ReLU             relu1_2          1 1 conv1_2 conv1_2_relu1_2
Pooling          pool1_stage1     1 1 conv1_2_relu1_2 pool1_stage1 0=0 1=2 2=2 3=0 4=0
Convolution      conv2_1          1 1 pool1_stage1 conv2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=73728
ReLU             relu2_1          1 1 conv2_1 conv2_1_relu2_1
Convolution      conv2_2          1 1 conv2_1_relu2_1 conv2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
ReLU             relu2_2          1 1 conv2_2 conv2_2_relu2_2
Pooling          pool2_stage1     1 1 conv2_2_relu2_2 pool2_stage1 0=0 1=2 2=2 3=0 4=0
Convolution      conv3_1          1 1 pool2_stage1 conv3_1 0=256 1=3 2=1 3=1 4=1 5=1 6=294912
ReLU             relu3_1          1 1 conv3_1 conv3_1_relu3_1
Convolution      conv3_2          1 1 conv3_1_relu3_1 conv3_2 0=256 1=3 2=1 3=1 4=1 5=1 6=589824
ReLU             relu3_2          1 1 conv3_2 conv3_2_relu3_2
Convolution      conv3_3          1 1 conv3_2_relu3_2 conv3_3 0=256 1=3 2=1 3=1 4=1 5=1 6=589824
ReLU             relu3_3          1 1 conv3_3 conv3_3_relu3_3
Convolution      conv3_4          1 1 conv3_3_relu3_3 conv3_4 0=256 1=3 2=1 3=1 4=1 5=1 6=589824
ReLU             relu3_4          1 1 conv3_4 conv3_4_relu3_4
Pooling          pool3_stage1     1 1 conv3_4_relu3_4 pool3_stage1 0=0 1=2 2=2 3=0 4=0
Convolution      conv4_1          1 1 pool3_stage1 conv4_1 0=512 1=3 2=1 3=1 4=1 5=1 6=1179648
ReLU             relu4_1          1 1 conv4_1 conv4_1_relu4_1
Convolution      conv4_2          1 1 conv4_1_relu4_1 conv4_2 0=512 1=3 2=1 3=1 4=1 5=1 6=2359296
PReLU            prelu4_2         1 1 conv4_2 conv4_2_prelu4_2 0=512
Convolution      conv4_3_CPM      1 1 conv4_2_prelu4_2 conv4_3_CPM 0=256 1=3 2=1 3=1 4=1 5=1 6=1179648
PReLU            prelu4_3_CPM     1 1 conv4_3_CPM conv4_3_CPM_prelu4_3_CPM 0=256
Convolution      conv4_4_CPM      1 1 conv4_3_CPM_prelu4_3_CPM conv4_4_CPM 0=128 1=3 2=1 3=1 4=1 5=1 6=294912
PReLU            prelu4_4_CPM     1 1 conv4_4_CPM conv4_4_CPM_prelu4_4_CPM 0=128
Split            splitncnn_0      1 6 conv4_4_CPM_prelu4_4_CPM conv4_4_CPM_prelu4_4_CPM_splitncnn_0 conv4_4_CPM_prelu4_4_CPM_splitncnn_1 conv4_4_CPM_prelu4_4_CPM_splitncnn_2 conv4_4_CPM_prelu4_4_CPM_splitncnn_3 conv4_4_CPM_prelu4_4_CPM_splitncnn_4 conv4_4_CPM_prelu4_4_CPM_splitncnn_5
Convolution      Mconv1_stage0_L2_0 1 1 conv4_4_CPM_prelu4_4_CPM_splitncnn_5 Mconv1_stage0_L2_0 0=96 1=3 2=1 3=1 4=1 5=1 6=110592
PReLU            Mprelu1_stage0_L2_0 1 1 Mconv1_stage0_L2_0 Mconv1_stage0_L2_0_Mprelu1_stage0_L2_0 0=96
Split            splitncnn_1      1 2 Mconv1_stage0_L2_0_Mprelu1_stage0_L2_0 Mconv1_stage0_L2_0_Mprelu1_stage0_L2_0_splitncnn_0 Mconv1_stage0_L2_0_Mprelu1_stage0_L2_0_splitncnn_1
Convolution      Mconv1_stage0_L2_1 1 1 Mconv1_stage0_L2_0_Mprelu1_stage0_L2_0_splitncnn_1 Mconv1_stage0_L2_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu1_stage0_L2_1 1 1 Mconv1_stage0_L2_1 Mconv1_stage0_L2_1_Mprelu1_stage0_L2_1 0=96
Split            splitncnn_2      1 2 Mconv1_stage0_L2_1_Mprelu1_stage0_L2_1 Mconv1_stage0_L2_1_Mprelu1_stage0_L2_1_splitncnn_0 Mconv1_stage0_L2_1_Mprelu1_stage0_L2_1_splitncnn_1
Convolution      Mconv1_stage0_L2_2 1 1 Mconv1_stage0_L2_1_Mprelu1_stage0_L2_1_splitncnn_1 Mconv1_stage0_L2_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu1_stage0_L2_2 1 1 Mconv1_stage0_L2_2 Mconv1_stage0_L2_2_Mprelu1_stage0_L2_2 0=96
Concat           Mconv1_stage0_L2_concat 3 1 Mconv1_stage0_L2_0_Mprelu1_stage0_L2_0_splitncnn_0 Mconv1_stage0_L2_1_Mprelu1_stage0_L2_1_splitncnn_0 Mconv1_stage0_L2_2_Mprelu1_stage0_L2_2 Mconv1_stage0_L2_concat 0=0
Convolution      Mconv2_stage0_L2_0 1 1 Mconv1_stage0_L2_concat Mconv2_stage0_L2_0 0=96 1=3 2=1 3=1 4=1 5=1 6=248832
PReLU            Mprelu2_stage0_L2_0 1 1 Mconv2_stage0_L2_0 Mconv2_stage0_L2_0_Mprelu2_stage0_L2_0 0=96
Split            splitncnn_3      1 2 Mconv2_stage0_L2_0_Mprelu2_stage0_L2_0 Mconv2_stage0_L2_0_Mprelu2_stage0_L2_0_splitncnn_0 Mconv2_stage0_L2_0_Mprelu2_stage0_L2_0_splitncnn_1
Convolution      Mconv2_stage0_L2_1 1 1 Mconv2_stage0_L2_0_Mprelu2_stage0_L2_0_splitncnn_1 Mconv2_stage0_L2_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu2_stage0_L2_1 1 1 Mconv2_stage0_L2_1 Mconv2_stage0_L2_1_Mprelu2_stage0_L2_1 0=96
Split            splitncnn_4      1 2 Mconv2_stage0_L2_1_Mprelu2_stage0_L2_1 Mconv2_stage0_L2_1_Mprelu2_stage0_L2_1_splitncnn_0 Mconv2_stage0_L2_1_Mprelu2_stage0_L2_1_splitncnn_1
Convolution      Mconv2_stage0_L2_2 1 1 Mconv2_stage0_L2_1_Mprelu2_stage0_L2_1_splitncnn_1 Mconv2_stage0_L2_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu2_stage0_L2_2 1 1 Mconv2_stage0_L2_2 Mconv2_stage0_L2_2_Mprelu2_stage0_L2_2 0=96
Concat           Mconv2_stage0_L2_concat 3 1 Mconv2_stage0_L2_0_Mprelu2_stage0_L2_0_splitncnn_0 Mconv2_stage0_L2_1_Mprelu2_stage0_L2_1_splitncnn_0 Mconv2_stage0_L2_2_Mprelu2_stage0_L2_2 Mconv2_stage0_L2_concat 0=0
Convolution      Mconv3_stage0_L2_0 1 1 Mconv2_stage0_L2_concat Mconv3_stage0_L2_0 0=96 1=3 2=1 3=1 4=1 5=1 6=248832
PReLU            Mprelu3_stage0_L2_0 1 1 Mconv3_stage0_L2_0 Mconv3_stage0_L2_0_Mprelu3_stage0_L2_0 0=96
Split            splitncnn_5      1 2 Mconv3_stage0_L2_0_Mprelu3_stage0_L2_0 Mconv3_stage0_L2_0_Mprelu3_stage0_L2_0_splitncnn_0 Mconv3_stage0_L2_0_Mprelu3_stage0_L2_0_splitncnn_1
Convolution      Mconv3_stage0_L2_1 1 1 Mconv3_stage0_L2_0_Mprelu3_stage0_L2_0_splitncnn_1 Mconv3_stage0_L2_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu3_stage0_L2_1 1 1 Mconv3_stage0_L2_1 Mconv3_stage0_L2_1_Mprelu3_stage0_L2_1 0=96
Split            splitncnn_6      1 2 Mconv3_stage0_L2_1_Mprelu3_stage0_L2_1 Mconv3_stage0_L2_1_Mprelu3_stage0_L2_1_splitncnn_0 Mconv3_stage0_L2_1_Mprelu3_stage0_L2_1_splitncnn_1
Convolution      Mconv3_stage0_L2_2 1 1 Mconv3_stage0_L2_1_Mprelu3_stage0_L2_1_splitncnn_1 Mconv3_stage0_L2_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu3_stage0_L2_2 1 1 Mconv3_stage0_L2_2 Mconv3_stage0_L2_2_Mprelu3_stage0_L2_2 0=96
Concat           Mconv3_stage0_L2_concat 3 1 Mconv3_stage0_L2_0_Mprelu3_stage0_L2_0_splitncnn_0 Mconv3_stage0_L2_1_Mprelu3_stage0_L2_1_splitncnn_0 Mconv3_stage0_L2_2_Mprelu3_stage0_L2_2 Mconv3_stage0_L2_concat 0=0
Convolution      Mconv4_stage0_L2_0 1 1 Mconv3_stage0_L2_concat Mconv4_stage0_L2_0 0=96 1=3 2=1 3=1 4=1 5=1 6=248832
PReLU            Mprelu4_stage0_L2_0 1 1 Mconv4_stage0_L2_0 Mconv4_stage0_L2_0_Mprelu4_stage0_L2_0 0=96
Split            splitncnn_7      1 2 Mconv4_stage0_L2_0_Mprelu4_stage0_L2_0 Mconv4_stage0_L2_0_Mprelu4_stage0_L2_0_splitncnn_0 Mconv4_stage0_L2_0_Mprelu4_stage0_L2_0_splitncnn_1
Convolution      Mconv4_stage0_L2_1 1 1 Mconv4_stage0_L2_0_Mprelu4_stage0_L2_0_splitncnn_1 Mconv4_stage0_L2_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu4_stage0_L2_1 1 1 Mconv4_stage0_L2_1 Mconv4_stage0_L2_1_Mprelu4_stage0_L2_1 0=96
Split            splitncnn_8      1 2 Mconv4_stage0_L2_1_Mprelu4_stage0_L2_1 Mconv4_stage0_L2_1_Mprelu4_stage0_L2_1_splitncnn_0 Mconv4_stage0_L2_1_Mprelu4_stage0_L2_1_splitncnn_1
Convolution      Mconv4_stage0_L2_2 1 1 Mconv4_stage0_L2_1_Mprelu4_stage0_L2_1_splitncnn_1 Mconv4_stage0_L2_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu4_stage0_L2_2 1 1 Mconv4_stage0_L2_2 Mconv4_stage0_L2_2_Mprelu4_stage0_L2_2 0=96
Concat           Mconv4_stage0_L2_concat 3 1 Mconv4_stage0_L2_0_Mprelu4_stage0_L2_0_splitncnn_0 Mconv4_stage0_L2_1_Mprelu4_stage0_L2_1_splitncnn_0 Mconv4_stage0_L2_2_Mprelu4_stage0_L2_2 Mconv4_stage0_L2_concat 0=0
Convolution      Mconv5_stage0_L2_0 1 1 Mconv4_stage0_L2_concat Mconv5_stage0_L2_0 0=96 1=3 2=1 3=1 4=1 5=1 6=248832
PReLU            Mprelu5_stage0_L2_0 1 1 Mconv5_stage0_L2_0 Mconv5_stage0_L2_0_Mprelu5_stage0_L2_0 0=96
Split            splitncnn_9      1 2 Mconv5_stage0_L2_0_Mprelu5_stage0_L2_0 Mconv5_stage0_L2_0_Mprelu5_stage0_L2_0_splitncnn_0 Mconv5_stage0_L2_0_Mprelu5_stage0_L2_0_splitncnn_1
Convolution      Mconv5_stage0_L2_1 1 1 Mconv5_stage0_L2_0_Mprelu5_stage0_L2_0_splitncnn_1 Mconv5_stage0_L2_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu5_stage0_L2_1 1 1 Mconv5_stage0_L2_1 Mconv5_stage0_L2_1_Mprelu5_stage0_L2_1 0=96
Split            splitncnn_10     1 2 Mconv5_stage0_L2_1_Mprelu5_stage0_L2_1 Mconv5_stage0_L2_1_Mprelu5_stage0_L2_1_splitncnn_0 Mconv5_stage0_L2_1_Mprelu5_stage0_L2_1_splitncnn_1
Convolution      Mconv5_stage0_L2_2 1 1 Mconv5_stage0_L2_1_Mprelu5_stage0_L2_1_splitncnn_1 Mconv5_stage0_L2_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu5_stage0_L2_2 1 1 Mconv5_stage0_L2_2 Mconv5_stage0_L2_2_Mprelu5_stage0_L2_2 0=96
Concat           Mconv5_stage0_L2_concat 3 1 Mconv5_stage0_L2_0_Mprelu5_stage0_L2_0_splitncnn_0 Mconv5_stage0_L2_1_Mprelu5_stage0_L2_1_splitncnn_0 Mconv5_stage0_L2_2_Mprelu5_stage0_L2_2 Mconv5_stage0_L2_concat 0=0
Convolution      Mconv6_stage0_L2 1 1 Mconv5_stage0_L2_concat Mconv6_stage0_L2 0=256 1=1 2=1 3=1 4=0 5=1 6=73728
PReLU            Mprelu6_stage0_L2 1 1 Mconv6_stage0_L2 Mconv6_stage0_L2_Mprelu6_stage0_L2 0=256
Convolution      Mconv7_stage0_L2 1 1 Mconv6_stage0_L2_Mprelu6_stage0_L2 Mconv7_stage0_L2 0=52 1=1 2=1 3=1 4=0 5=1 6=13312
Concat           concat_stage1_L2 2 1 conv4_4_CPM_prelu4_4_CPM_splitncnn_4 Mconv7_stage0_L2 concat_stage1_L2 0=0
Convolution      Mconv1_stage1_L2_0 1 1 concat_stage1_L2 Mconv1_stage1_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=207360
PReLU            Mprelu1_stage1_L2_0 1 1 Mconv1_stage1_L2_0 Mconv1_stage1_L2_0_Mprelu1_stage1_L2_0 0=128
Split            splitncnn_11     1 2 Mconv1_stage1_L2_0_Mprelu1_stage1_L2_0 Mconv1_stage1_L2_0_Mprelu1_stage1_L2_0_splitncnn_0 Mconv1_stage1_L2_0_Mprelu1_stage1_L2_0_splitncnn_1
Convolution      Mconv1_stage1_L2_1 1 1 Mconv1_stage1_L2_0_Mprelu1_stage1_L2_0_splitncnn_1 Mconv1_stage1_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu1_stage1_L2_1 1 1 Mconv1_stage1_L2_1 Mconv1_stage1_L2_1_Mprelu1_stage1_L2_1 0=128
Split            splitncnn_12     1 2 Mconv1_stage1_L2_1_Mprelu1_stage1_L2_1 Mconv1_stage1_L2_1_Mprelu1_stage1_L2_1_splitncnn_0 Mconv1_stage1_L2_1_Mprelu1_stage1_L2_1_splitncnn_1
Convolution      Mconv1_stage1_L2_2 1 1 Mconv1_stage1_L2_1_Mprelu1_stage1_L2_1_splitncnn_1 Mconv1_stage1_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu1_stage1_L2_2 1 1 Mconv1_stage1_L2_2 Mconv1_stage1_L2_2_Mprelu1_stage1_L2_2 0=128
Concat           Mconv1_stage1_L2_concat 3 1 Mconv1_stage1_L2_0_Mprelu1_stage1_L2_0_splitncnn_0 Mconv1_stage1_L2_1_Mprelu1_stage1_L2_1_splitncnn_0 Mconv1_stage1_L2_2_Mprelu1_stage1_L2_2 Mconv1_stage1_L2_concat 0=0
Convolution      Mconv2_stage1_L2_0 1 1 Mconv1_stage1_L2_concat Mconv2_stage1_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu2_stage1_L2_0 1 1 Mconv2_stage1_L2_0 Mconv2_stage1_L2_0_Mprelu2_stage1_L2_0 0=128
Split            splitncnn_13     1 2 Mconv2_stage1_L2_0_Mprelu2_stage1_L2_0 Mconv2_stage1_L2_0_Mprelu2_stage1_L2_0_splitncnn_0 Mconv2_stage1_L2_0_Mprelu2_stage1_L2_0_splitncnn_1
Convolution      Mconv2_stage1_L2_1 1 1 Mconv2_stage1_L2_0_Mprelu2_stage1_L2_0_splitncnn_1 Mconv2_stage1_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu2_stage1_L2_1 1 1 Mconv2_stage1_L2_1 Mconv2_stage1_L2_1_Mprelu2_stage1_L2_1 0=128
Split            splitncnn_14     1 2 Mconv2_stage1_L2_1_Mprelu2_stage1_L2_1 Mconv2_stage1_L2_1_Mprelu2_stage1_L2_1_splitncnn_0 Mconv2_stage1_L2_1_Mprelu2_stage1_L2_1_splitncnn_1
Convolution      Mconv2_stage1_L2_2 1 1 Mconv2_stage1_L2_1_Mprelu2_stage1_L2_1_splitncnn_1 Mconv2_stage1_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu2_stage1_L2_2 1 1 Mconv2_stage1_L2_2 Mconv2_stage1_L2_2_Mprelu2_stage1_L2_2 0=128
Concat           Mconv2_stage1_L2_concat 3 1 Mconv2_stage1_L2_0_Mprelu2_stage1_L2_0_splitncnn_0 Mconv2_stage1_L2_1_Mprelu2_stage1_L2_1_splitncnn_0 Mconv2_stage1_L2_2_Mprelu2_stage1_L2_2 Mconv2_stage1_L2_concat 0=0
Convolution      Mconv3_stage1_L2_0 1 1 Mconv2_stage1_L2_concat Mconv3_stage1_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu3_stage1_L2_0 1 1 Mconv3_stage1_L2_0 Mconv3_stage1_L2_0_Mprelu3_stage1_L2_0 0=128
Split            splitncnn_15     1 2 Mconv3_stage1_L2_0_Mprelu3_stage1_L2_0 Mconv3_stage1_L2_0_Mprelu3_stage1_L2_0_splitncnn_0 Mconv3_stage1_L2_0_Mprelu3_stage1_L2_0_splitncnn_1
Convolution      Mconv3_stage1_L2_1 1 1 Mconv3_stage1_L2_0_Mprelu3_stage1_L2_0_splitncnn_1 Mconv3_stage1_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu3_stage1_L2_1 1 1 Mconv3_stage1_L2_1 Mconv3_stage1_L2_1_Mprelu3_stage1_L2_1 0=128
Split            splitncnn_16     1 2 Mconv3_stage1_L2_1_Mprelu3_stage1_L2_1 Mconv3_stage1_L2_1_Mprelu3_stage1_L2_1_splitncnn_0 Mconv3_stage1_L2_1_Mprelu3_stage1_L2_1_splitncnn_1
Convolution      Mconv3_stage1_L2_2 1 1 Mconv3_stage1_L2_1_Mprelu3_stage1_L2_1_splitncnn_1 Mconv3_stage1_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu3_stage1_L2_2 1 1 Mconv3_stage1_L2_2 Mconv3_stage1_L2_2_Mprelu3_stage1_L2_2 0=128
Concat           Mconv3_stage1_L2_concat 3 1 Mconv3_stage1_L2_0_Mprelu3_stage1_L2_0_splitncnn_0 Mconv3_stage1_L2_1_Mprelu3_stage1_L2_1_splitncnn_0 Mconv3_stage1_L2_2_Mprelu3_stage1_L2_2 Mconv3_stage1_L2_concat 0=0
Convolution      Mconv4_stage1_L2_0 1 1 Mconv3_stage1_L2_concat Mconv4_stage1_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu4_stage1_L2_0 1 1 Mconv4_stage1_L2_0 Mconv4_stage1_L2_0_Mprelu4_stage1_L2_0 0=128
Split            splitncnn_17     1 2 Mconv4_stage1_L2_0_Mprelu4_stage1_L2_0 Mconv4_stage1_L2_0_Mprelu4_stage1_L2_0_splitncnn_0 Mconv4_stage1_L2_0_Mprelu4_stage1_L2_0_splitncnn_1
Convolution      Mconv4_stage1_L2_1 1 1 Mconv4_stage1_L2_0_Mprelu4_stage1_L2_0_splitncnn_1 Mconv4_stage1_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu4_stage1_L2_1 1 1 Mconv4_stage1_L2_1 Mconv4_stage1_L2_1_Mprelu4_stage1_L2_1 0=128
Split            splitncnn_18     1 2 Mconv4_stage1_L2_1_Mprelu4_stage1_L2_1 Mconv4_stage1_L2_1_Mprelu4_stage1_L2_1_splitncnn_0 Mconv4_stage1_L2_1_Mprelu4_stage1_L2_1_splitncnn_1
Convolution      Mconv4_stage1_L2_2 1 1 Mconv4_stage1_L2_1_Mprelu4_stage1_L2_1_splitncnn_1 Mconv4_stage1_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu4_stage1_L2_2 1 1 Mconv4_stage1_L2_2 Mconv4_stage1_L2_2_Mprelu4_stage1_L2_2 0=128
Concat           Mconv4_stage1_L2_concat 3 1 Mconv4_stage1_L2_0_Mprelu4_stage1_L2_0_splitncnn_0 Mconv4_stage1_L2_1_Mprelu4_stage1_L2_1_splitncnn_0 Mconv4_stage1_L2_2_Mprelu4_stage1_L2_2 Mconv4_stage1_L2_concat 0=0
Convolution      Mconv5_stage1_L2_0 1 1 Mconv4_stage1_L2_concat Mconv5_stage1_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu5_stage1_L2_0 1 1 Mconv5_stage1_L2_0 Mconv5_stage1_L2_0_Mprelu5_stage1_L2_0 0=128
Split            splitncnn_19     1 2 Mconv5_stage1_L2_0_Mprelu5_stage1_L2_0 Mconv5_stage1_L2_0_Mprelu5_stage1_L2_0_splitncnn_0 Mconv5_stage1_L2_0_Mprelu5_stage1_L2_0_splitncnn_1
Convolution      Mconv5_stage1_L2_1 1 1 Mconv5_stage1_L2_0_Mprelu5_stage1_L2_0_splitncnn_1 Mconv5_stage1_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu5_stage1_L2_1 1 1 Mconv5_stage1_L2_1 Mconv5_stage1_L2_1_Mprelu5_stage1_L2_1 0=128
Split            splitncnn_20     1 2 Mconv5_stage1_L2_1_Mprelu5_stage1_L2_1 Mconv5_stage1_L2_1_Mprelu5_stage1_L2_1_splitncnn_0 Mconv5_stage1_L2_1_Mprelu5_stage1_L2_1_splitncnn_1
Convolution      Mconv5_stage1_L2_2 1 1 Mconv5_stage1_L2_1_Mprelu5_stage1_L2_1_splitncnn_1 Mconv5_stage1_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu5_stage1_L2_2 1 1 Mconv5_stage1_L2_2 Mconv5_stage1_L2_2_Mprelu5_stage1_L2_2 0=128
Concat           Mconv5_stage1_L2_concat 3 1 Mconv5_stage1_L2_0_Mprelu5_stage1_L2_0_splitncnn_0 Mconv5_stage1_L2_1_Mprelu5_stage1_L2_1_splitncnn_0 Mconv5_stage1_L2_2_Mprelu5_stage1_L2_2 Mconv5_stage1_L2_concat 0=0
Convolution      Mconv6_stage1_L2 1 1 Mconv5_stage1_L2_concat Mconv6_stage1_L2 0=512 1=1 2=1 3=1 4=0 5=1 6=196608
PReLU            Mprelu6_stage1_L2 1 1 Mconv6_stage1_L2 Mconv6_stage1_L2_Mprelu6_stage1_L2 0=512
Convolution      Mconv7_stage1_L2 1 1 Mconv6_stage1_L2_Mprelu6_stage1_L2 Mconv7_stage1_L2 0=52 1=1 2=1 3=1 4=0 5=1 6=26624
Concat           concat_stage2_L2 2 1 conv4_4_CPM_prelu4_4_CPM_splitncnn_3 Mconv7_stage1_L2 concat_stage2_L2 0=0
Convolution      Mconv1_stage2_L2_0 1 1 concat_stage2_L2 Mconv1_stage2_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=207360
PReLU            Mprelu1_stage2_L2_0 1 1 Mconv1_stage2_L2_0 Mconv1_stage2_L2_0_Mprelu1_stage2_L2_0 0=128
Split            splitncnn_21     1 2 Mconv1_stage2_L2_0_Mprelu1_stage2_L2_0 Mconv1_stage2_L2_0_Mprelu1_stage2_L2_0_splitncnn_0 Mconv1_stage2_L2_0_Mprelu1_stage2_L2_0_splitncnn_1
Convolution      Mconv1_stage2_L2_1 1 1 Mconv1_stage2_L2_0_Mprelu1_stage2_L2_0_splitncnn_1 Mconv1_stage2_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu1_stage2_L2_1 1 1 Mconv1_stage2_L2_1 Mconv1_stage2_L2_1_Mprelu1_stage2_L2_1 0=128
Split            splitncnn_22     1 2 Mconv1_stage2_L2_1_Mprelu1_stage2_L2_1 Mconv1_stage2_L2_1_Mprelu1_stage2_L2_1_splitncnn_0 Mconv1_stage2_L2_1_Mprelu1_stage2_L2_1_splitncnn_1
Convolution      Mconv1_stage2_L2_2 1 1 Mconv1_stage2_L2_1_Mprelu1_stage2_L2_1_splitncnn_1 Mconv1_stage2_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu1_stage2_L2_2 1 1 Mconv1_stage2_L2_2 Mconv1_stage2_L2_2_Mprelu1_stage2_L2_2 0=128
Concat           Mconv1_stage2_L2_concat 3 1 Mconv1_stage2_L2_0_Mprelu1_stage2_L2_0_splitncnn_0 Mconv1_stage2_L2_1_Mprelu1_stage2_L2_1_splitncnn_0 Mconv1_stage2_L2_2_Mprelu1_stage2_L2_2 Mconv1_stage2_L2_concat 0=0
Convolution      Mconv2_stage2_L2_0 1 1 Mconv1_stage2_L2_concat Mconv2_stage2_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu2_stage2_L2_0 1 1 Mconv2_stage2_L2_0 Mconv2_stage2_L2_0_Mprelu2_stage2_L2_0 0=128
Split            splitncnn_23     1 2 Mconv2_stage2_L2_0_Mprelu2_stage2_L2_0 Mconv2_stage2_L2_0_Mprelu2_stage2_L2_0_splitncnn_0 Mconv2_stage2_L2_0_Mprelu2_stage2_L2_0_splitncnn_1
Convolution      Mconv2_stage2_L2_1 1 1 Mconv2_stage2_L2_0_Mprelu2_stage2_L2_0_splitncnn_1 Mconv2_stage2_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu2_stage2_L2_1 1 1 Mconv2_stage2_L2_1 Mconv2_stage2_L2_1_Mprelu2_stage2_L2_1 0=128
Split            splitncnn_24     1 2 Mconv2_stage2_L2_1_Mprelu2_stage2_L2_1 Mconv2_stage2_L2_1_Mprelu2_stage2_L2_1_splitncnn_0 Mconv2_stage2_L2_1_Mprelu2_stage2_L2_1_splitncnn_1
Convolution      Mconv2_stage2_L2_2 1 1 Mconv2_stage2_L2_1_Mprelu2_stage2_L2_1_splitncnn_1 Mconv2_stage2_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu2_stage2_L2_2 1 1 Mconv2_stage2_L2_2 Mconv2_stage2_L2_2_Mprelu2_stage2_L2_2 0=128
Concat           Mconv2_stage2_L2_concat 3 1 Mconv2_stage2_L2_0_Mprelu2_stage2_L2_0_splitncnn_0 Mconv2_stage2_L2_1_Mprelu2_stage2_L2_1_splitncnn_0 Mconv2_stage2_L2_2_Mprelu2_stage2_L2_2 Mconv2_stage2_L2_concat 0=0
Convolution      Mconv3_stage2_L2_0 1 1 Mconv2_stage2_L2_concat Mconv3_stage2_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu3_stage2_L2_0 1 1 Mconv3_stage2_L2_0 Mconv3_stage2_L2_0_Mprelu3_stage2_L2_0 0=128
Split            splitncnn_25     1 2 Mconv3_stage2_L2_0_Mprelu3_stage2_L2_0 Mconv3_stage2_L2_0_Mprelu3_stage2_L2_0_splitncnn_0 Mconv3_stage2_L2_0_Mprelu3_stage2_L2_0_splitncnn_1
Convolution      Mconv3_stage2_L2_1 1 1 Mconv3_stage2_L2_0_Mprelu3_stage2_L2_0_splitncnn_1 Mconv3_stage2_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu3_stage2_L2_1 1 1 Mconv3_stage2_L2_1 Mconv3_stage2_L2_1_Mprelu3_stage2_L2_1 0=128
Split            splitncnn_26     1 2 Mconv3_stage2_L2_1_Mprelu3_stage2_L2_1 Mconv3_stage2_L2_1_Mprelu3_stage2_L2_1_splitncnn_0 Mconv3_stage2_L2_1_Mprelu3_stage2_L2_1_splitncnn_1
Convolution      Mconv3_stage2_L2_2 1 1 Mconv3_stage2_L2_1_Mprelu3_stage2_L2_1_splitncnn_1 Mconv3_stage2_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu3_stage2_L2_2 1 1 Mconv3_stage2_L2_2 Mconv3_stage2_L2_2_Mprelu3_stage2_L2_2 0=128
Concat           Mconv3_stage2_L2_concat 3 1 Mconv3_stage2_L2_0_Mprelu3_stage2_L2_0_splitncnn_0 Mconv3_stage2_L2_1_Mprelu3_stage2_L2_1_splitncnn_0 Mconv3_stage2_L2_2_Mprelu3_stage2_L2_2 Mconv3_stage2_L2_concat 0=0
Convolution      Mconv4_stage2_L2_0 1 1 Mconv3_stage2_L2_concat Mconv4_stage2_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu4_stage2_L2_0 1 1 Mconv4_stage2_L2_0 Mconv4_stage2_L2_0_Mprelu4_stage2_L2_0 0=128
Split            splitncnn_27     1 2 Mconv4_stage2_L2_0_Mprelu4_stage2_L2_0 Mconv4_stage2_L2_0_Mprelu4_stage2_L2_0_splitncnn_0 Mconv4_stage2_L2_0_Mprelu4_stage2_L2_0_splitncnn_1
Convolution      Mconv4_stage2_L2_1 1 1 Mconv4_stage2_L2_0_Mprelu4_stage2_L2_0_splitncnn_1 Mconv4_stage2_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu4_stage2_L2_1 1 1 Mconv4_stage2_L2_1 Mconv4_stage2_L2_1_Mprelu4_stage2_L2_1 0=128
Split            splitncnn_28     1 2 Mconv4_stage2_L2_1_Mprelu4_stage2_L2_1 Mconv4_stage2_L2_1_Mprelu4_stage2_L2_1_splitncnn_0 Mconv4_stage2_L2_1_Mprelu4_stage2_L2_1_splitncnn_1
Convolution      Mconv4_stage2_L2_2 1 1 Mconv4_stage2_L2_1_Mprelu4_stage2_L2_1_splitncnn_1 Mconv4_stage2_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu4_stage2_L2_2 1 1 Mconv4_stage2_L2_2 Mconv4_stage2_L2_2_Mprelu4_stage2_L2_2 0=128
Concat           Mconv4_stage2_L2_concat 3 1 Mconv4_stage2_L2_0_Mprelu4_stage2_L2_0_splitncnn_0 Mconv4_stage2_L2_1_Mprelu4_stage2_L2_1_splitncnn_0 Mconv4_stage2_L2_2_Mprelu4_stage2_L2_2 Mconv4_stage2_L2_concat 0=0
Convolution      Mconv5_stage2_L2_0 1 1 Mconv4_stage2_L2_concat Mconv5_stage2_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu5_stage2_L2_0 1 1 Mconv5_stage2_L2_0 Mconv5_stage2_L2_0_Mprelu5_stage2_L2_0 0=128
Split            splitncnn_29     1 2 Mconv5_stage2_L2_0_Mprelu5_stage2_L2_0 Mconv5_stage2_L2_0_Mprelu5_stage2_L2_0_splitncnn_0 Mconv5_stage2_L2_0_Mprelu5_stage2_L2_0_splitncnn_1
Convolution      Mconv5_stage2_L2_1 1 1 Mconv5_stage2_L2_0_Mprelu5_stage2_L2_0_splitncnn_1 Mconv5_stage2_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu5_stage2_L2_1 1 1 Mconv5_stage2_L2_1 Mconv5_stage2_L2_1_Mprelu5_stage2_L2_1 0=128
Split            splitncnn_30     1 2 Mconv5_stage2_L2_1_Mprelu5_stage2_L2_1 Mconv5_stage2_L2_1_Mprelu5_stage2_L2_1_splitncnn_0 Mconv5_stage2_L2_1_Mprelu5_stage2_L2_1_splitncnn_1
Convolution      Mconv5_stage2_L2_2 1 1 Mconv5_stage2_L2_1_Mprelu5_stage2_L2_1_splitncnn_1 Mconv5_stage2_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu5_stage2_L2_2 1 1 Mconv5_stage2_L2_2 Mconv5_stage2_L2_2_Mprelu5_stage2_L2_2 0=128
Concat           Mconv5_stage2_L2_concat 3 1 Mconv5_stage2_L2_0_Mprelu5_stage2_L2_0_splitncnn_0 Mconv5_stage2_L2_1_Mprelu5_stage2_L2_1_splitncnn_0 Mconv5_stage2_L2_2_Mprelu5_stage2_L2_2 Mconv5_stage2_L2_concat 0=0
Convolution      Mconv6_stage2_L2 1 1 Mconv5_stage2_L2_concat Mconv6_stage2_L2 0=512 1=1 2=1 3=1 4=0 5=1 6=196608
PReLU            Mprelu6_stage2_L2 1 1 Mconv6_stage2_L2 Mconv6_stage2_L2_Mprelu6_stage2_L2 0=512
Convolution      Mconv7_stage2_L2 1 1 Mconv6_stage2_L2_Mprelu6_stage2_L2 Mconv7_stage2_L2 0=52 1=1 2=1 3=1 4=0 5=1 6=26624
Concat           concat_stage3_L2 2 1 conv4_4_CPM_prelu4_4_CPM_splitncnn_2 Mconv7_stage2_L2 concat_stage3_L2 0=0
Convolution      Mconv1_stage3_L2_0 1 1 concat_stage3_L2 Mconv1_stage3_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=207360
PReLU            Mprelu1_stage3_L2_0 1 1 Mconv1_stage3_L2_0 Mconv1_stage3_L2_0_Mprelu1_stage3_L2_0 0=128
Split            splitncnn_31     1 2 Mconv1_stage3_L2_0_Mprelu1_stage3_L2_0 Mconv1_stage3_L2_0_Mprelu1_stage3_L2_0_splitncnn_0 Mconv1_stage3_L2_0_Mprelu1_stage3_L2_0_splitncnn_1
Convolution      Mconv1_stage3_L2_1 1 1 Mconv1_stage3_L2_0_Mprelu1_stage3_L2_0_splitncnn_1 Mconv1_stage3_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu1_stage3_L2_1 1 1 Mconv1_stage3_L2_1 Mconv1_stage3_L2_1_Mprelu1_stage3_L2_1 0=128
Split            splitncnn_32     1 2 Mconv1_stage3_L2_1_Mprelu1_stage3_L2_1 Mconv1_stage3_L2_1_Mprelu1_stage3_L2_1_splitncnn_0 Mconv1_stage3_L2_1_Mprelu1_stage3_L2_1_splitncnn_1
Convolution      Mconv1_stage3_L2_2 1 1 Mconv1_stage3_L2_1_Mprelu1_stage3_L2_1_splitncnn_1 Mconv1_stage3_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu1_stage3_L2_2 1 1 Mconv1_stage3_L2_2 Mconv1_stage3_L2_2_Mprelu1_stage3_L2_2 0=128
Concat           Mconv1_stage3_L2_concat 3 1 Mconv1_stage3_L2_0_Mprelu1_stage3_L2_0_splitncnn_0 Mconv1_stage3_L2_1_Mprelu1_stage3_L2_1_splitncnn_0 Mconv1_stage3_L2_2_Mprelu1_stage3_L2_2 Mconv1_stage3_L2_concat 0=0
Convolution      Mconv2_stage3_L2_0 1 1 Mconv1_stage3_L2_concat Mconv2_stage3_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu2_stage3_L2_0 1 1 Mconv2_stage3_L2_0 Mconv2_stage3_L2_0_Mprelu2_stage3_L2_0 0=128
Split            splitncnn_33     1 2 Mconv2_stage3_L2_0_Mprelu2_stage3_L2_0 Mconv2_stage3_L2_0_Mprelu2_stage3_L2_0_splitncnn_0 Mconv2_stage3_L2_0_Mprelu2_stage3_L2_0_splitncnn_1
Convolution      Mconv2_stage3_L2_1 1 1 Mconv2_stage3_L2_0_Mprelu2_stage3_L2_0_splitncnn_1 Mconv2_stage3_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu2_stage3_L2_1 1 1 Mconv2_stage3_L2_1 Mconv2_stage3_L2_1_Mprelu2_stage3_L2_1 0=128
Split            splitncnn_34     1 2 Mconv2_stage3_L2_1_Mprelu2_stage3_L2_1 Mconv2_stage3_L2_1_Mprelu2_stage3_L2_1_splitncnn_0 Mconv2_stage3_L2_1_Mprelu2_stage3_L2_1_splitncnn_1
Convolution      Mconv2_stage3_L2_2 1 1 Mconv2_stage3_L2_1_Mprelu2_stage3_L2_1_splitncnn_1 Mconv2_stage3_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu2_stage3_L2_2 1 1 Mconv2_stage3_L2_2 Mconv2_stage3_L2_2_Mprelu2_stage3_L2_2 0=128
Concat           Mconv2_stage3_L2_concat 3 1 Mconv2_stage3_L2_0_Mprelu2_stage3_L2_0_splitncnn_0 Mconv2_stage3_L2_1_Mprelu2_stage3_L2_1_splitncnn_0 Mconv2_stage3_L2_2_Mprelu2_stage3_L2_2 Mconv2_stage3_L2_concat 0=0
Convolution      Mconv3_stage3_L2_0 1 1 Mconv2_stage3_L2_concat Mconv3_stage3_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu3_stage3_L2_0 1 1 Mconv3_stage3_L2_0 Mconv3_stage3_L2_0_Mprelu3_stage3_L2_0 0=128
Split            splitncnn_35     1 2 Mconv3_stage3_L2_0_Mprelu3_stage3_L2_0 Mconv3_stage3_L2_0_Mprelu3_stage3_L2_0_splitncnn_0 Mconv3_stage3_L2_0_Mprelu3_stage3_L2_0_splitncnn_1
Convolution      Mconv3_stage3_L2_1 1 1 Mconv3_stage3_L2_0_Mprelu3_stage3_L2_0_splitncnn_1 Mconv3_stage3_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu3_stage3_L2_1 1 1 Mconv3_stage3_L2_1 Mconv3_stage3_L2_1_Mprelu3_stage3_L2_1 0=128
Split            splitncnn_36     1 2 Mconv3_stage3_L2_1_Mprelu3_stage3_L2_1 Mconv3_stage3_L2_1_Mprelu3_stage3_L2_1_splitncnn_0 Mconv3_stage3_L2_1_Mprelu3_stage3_L2_1_splitncnn_1
Convolution      Mconv3_stage3_L2_2 1 1 Mconv3_stage3_L2_1_Mprelu3_stage3_L2_1_splitncnn_1 Mconv3_stage3_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu3_stage3_L2_2 1 1 Mconv3_stage3_L2_2 Mconv3_stage3_L2_2_Mprelu3_stage3_L2_2 0=128
Concat           Mconv3_stage3_L2_concat 3 1 Mconv3_stage3_L2_0_Mprelu3_stage3_L2_0_splitncnn_0 Mconv3_stage3_L2_1_Mprelu3_stage3_L2_1_splitncnn_0 Mconv3_stage3_L2_2_Mprelu3_stage3_L2_2 Mconv3_stage3_L2_concat 0=0
Convolution      Mconv4_stage3_L2_0 1 1 Mconv3_stage3_L2_concat Mconv4_stage3_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu4_stage3_L2_0 1 1 Mconv4_stage3_L2_0 Mconv4_stage3_L2_0_Mprelu4_stage3_L2_0 0=128
Split            splitncnn_37     1 2 Mconv4_stage3_L2_0_Mprelu4_stage3_L2_0 Mconv4_stage3_L2_0_Mprelu4_stage3_L2_0_splitncnn_0 Mconv4_stage3_L2_0_Mprelu4_stage3_L2_0_splitncnn_1
Convolution      Mconv4_stage3_L2_1 1 1 Mconv4_stage3_L2_0_Mprelu4_stage3_L2_0_splitncnn_1 Mconv4_stage3_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu4_stage3_L2_1 1 1 Mconv4_stage3_L2_1 Mconv4_stage3_L2_1_Mprelu4_stage3_L2_1 0=128
Split            splitncnn_38     1 2 Mconv4_stage3_L2_1_Mprelu4_stage3_L2_1 Mconv4_stage3_L2_1_Mprelu4_stage3_L2_1_splitncnn_0 Mconv4_stage3_L2_1_Mprelu4_stage3_L2_1_splitncnn_1
Convolution      Mconv4_stage3_L2_2 1 1 Mconv4_stage3_L2_1_Mprelu4_stage3_L2_1_splitncnn_1 Mconv4_stage3_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu4_stage3_L2_2 1 1 Mconv4_stage3_L2_2 Mconv4_stage3_L2_2_Mprelu4_stage3_L2_2 0=128
Concat           Mconv4_stage3_L2_concat 3 1 Mconv4_stage3_L2_0_Mprelu4_stage3_L2_0_splitncnn_0 Mconv4_stage3_L2_1_Mprelu4_stage3_L2_1_splitncnn_0 Mconv4_stage3_L2_2_Mprelu4_stage3_L2_2 Mconv4_stage3_L2_concat 0=0
Convolution      Mconv5_stage3_L2_0 1 1 Mconv4_stage3_L2_concat Mconv5_stage3_L2_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu5_stage3_L2_0 1 1 Mconv5_stage3_L2_0 Mconv5_stage3_L2_0_Mprelu5_stage3_L2_0 0=128
Split            splitncnn_39     1 2 Mconv5_stage3_L2_0_Mprelu5_stage3_L2_0 Mconv5_stage3_L2_0_Mprelu5_stage3_L2_0_splitncnn_0 Mconv5_stage3_L2_0_Mprelu5_stage3_L2_0_splitncnn_1
Convolution      Mconv5_stage3_L2_1 1 1 Mconv5_stage3_L2_0_Mprelu5_stage3_L2_0_splitncnn_1 Mconv5_stage3_L2_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu5_stage3_L2_1 1 1 Mconv5_stage3_L2_1 Mconv5_stage3_L2_1_Mprelu5_stage3_L2_1 0=128
Split            splitncnn_40     1 2 Mconv5_stage3_L2_1_Mprelu5_stage3_L2_1 Mconv5_stage3_L2_1_Mprelu5_stage3_L2_1_splitncnn_0 Mconv5_stage3_L2_1_Mprelu5_stage3_L2_1_splitncnn_1
Convolution      Mconv5_stage3_L2_2 1 1 Mconv5_stage3_L2_1_Mprelu5_stage3_L2_1_splitncnn_1 Mconv5_stage3_L2_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu5_stage3_L2_2 1 1 Mconv5_stage3_L2_2 Mconv5_stage3_L2_2_Mprelu5_stage3_L2_2 0=128
Concat           Mconv5_stage3_L2_concat 3 1 Mconv5_stage3_L2_0_Mprelu5_stage3_L2_0_splitncnn_0 Mconv5_stage3_L2_1_Mprelu5_stage3_L2_1_splitncnn_0 Mconv5_stage3_L2_2_Mprelu5_stage3_L2_2 Mconv5_stage3_L2_concat 0=0
Convolution      Mconv6_stage3_L2 1 1 Mconv5_stage3_L2_concat Mconv6_stage3_L2 0=512 1=1 2=1 3=1 4=0 5=1 6=196608
PReLU            Mprelu6_stage3_L2 1 1 Mconv6_stage3_L2 Mconv6_stage3_L2_Mprelu6_stage3_L2 0=512
Convolution      Mconv7_stage3_L2 1 1 Mconv6_stage3_L2_Mprelu6_stage3_L2 Mconv7_stage3_L2 0=52 1=1 2=1 3=1 4=0 5=1 6=26624
Split            splitncnn_41     1 3 Mconv7_stage3_L2 Mconv7_stage3_L2_splitncnn_0 Mconv7_stage3_L2_splitncnn_1 Mconv7_stage3_L2_splitncnn_2
Concat           concat_stage0_L1 2 1 conv4_4_CPM_prelu4_4_CPM_splitncnn_1 Mconv7_stage3_L2_splitncnn_2 concat_stage0_L1 0=0
Convolution      Mconv1_stage0_L1_0 1 1 concat_stage0_L1 Mconv1_stage0_L1_0 0=96 1=3 2=1 3=1 4=1 5=1 6=155520
PReLU            Mprelu1_stage0_L1_0 1 1 Mconv1_stage0_L1_0 Mconv1_stage0_L1_0_Mprelu1_stage0_L1_0 0=96
Split            splitncnn_42     1 2 Mconv1_stage0_L1_0_Mprelu1_stage0_L1_0 Mconv1_stage0_L1_0_Mprelu1_stage0_L1_0_splitncnn_0 Mconv1_stage0_L1_0_Mprelu1_stage0_L1_0_splitncnn_1
Convolution      Mconv1_stage0_L1_1 1 1 Mconv1_stage0_L1_0_Mprelu1_stage0_L1_0_splitncnn_1 Mconv1_stage0_L1_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu1_stage0_L1_1 1 1 Mconv1_stage0_L1_1 Mconv1_stage0_L1_1_Mprelu1_stage0_L1_1 0=96
Split            splitncnn_43     1 2 Mconv1_stage0_L1_1_Mprelu1_stage0_L1_1 Mconv1_stage0_L1_1_Mprelu1_stage0_L1_1_splitncnn_0 Mconv1_stage0_L1_1_Mprelu1_stage0_L1_1_splitncnn_1
Convolution      Mconv1_stage0_L1_2 1 1 Mconv1_stage0_L1_1_Mprelu1_stage0_L1_1_splitncnn_1 Mconv1_stage0_L1_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu1_stage0_L1_2 1 1 Mconv1_stage0_L1_2 Mconv1_stage0_L1_2_Mprelu1_stage0_L1_2 0=96
Concat           Mconv1_stage0_L1_concat 3 1 Mconv1_stage0_L1_0_Mprelu1_stage0_L1_0_splitncnn_0 Mconv1_stage0_L1_1_Mprelu1_stage0_L1_1_splitncnn_0 Mconv1_stage0_L1_2_Mprelu1_stage0_L1_2 Mconv1_stage0_L1_concat 0=0
Convolution      Mconv2_stage0_L1_0 1 1 Mconv1_stage0_L1_concat Mconv2_stage0_L1_0 0=96 1=3 2=1 3=1 4=1 5=1 6=248832
PReLU            Mprelu2_stage0_L1_0 1 1 Mconv2_stage0_L1_0 Mconv2_stage0_L1_0_Mprelu2_stage0_L1_0 0=96
Split            splitncnn_44     1 2 Mconv2_stage0_L1_0_Mprelu2_stage0_L1_0 Mconv2_stage0_L1_0_Mprelu2_stage0_L1_0_splitncnn_0 Mconv2_stage0_L1_0_Mprelu2_stage0_L1_0_splitncnn_1
Convolution      Mconv2_stage0_L1_1 1 1 Mconv2_stage0_L1_0_Mprelu2_stage0_L1_0_splitncnn_1 Mconv2_stage0_L1_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu2_stage0_L1_1 1 1 Mconv2_stage0_L1_1 Mconv2_stage0_L1_1_Mprelu2_stage0_L1_1 0=96
Split            splitncnn_45     1 2 Mconv2_stage0_L1_1_Mprelu2_stage0_L1_1 Mconv2_stage0_L1_1_Mprelu2_stage0_L1_1_splitncnn_0 Mconv2_stage0_L1_1_Mprelu2_stage0_L1_1_splitncnn_1
Convolution      Mconv2_stage0_L1_2 1 1 Mconv2_stage0_L1_1_Mprelu2_stage0_L1_1_splitncnn_1 Mconv2_stage0_L1_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu2_stage0_L1_2 1 1 Mconv2_stage0_L1_2 Mconv2_stage0_L1_2_Mprelu2_stage0_L1_2 0=96
Concat           Mconv2_stage0_L1_concat 3 1 Mconv2_stage0_L1_0_Mprelu2_stage0_L1_0_splitncnn_0 Mconv2_stage0_L1_1_Mprelu2_stage0_L1_1_splitncnn_0 Mconv2_stage0_L1_2_Mprelu2_stage0_L1_2 Mconv2_stage0_L1_concat 0=0
Convolution      Mconv3_stage0_L1_0 1 1 Mconv2_stage0_L1_concat Mconv3_stage0_L1_0 0=96 1=3 2=1 3=1 4=1 5=1 6=248832
PReLU            Mprelu3_stage0_L1_0 1 1 Mconv3_stage0_L1_0 Mconv3_stage0_L1_0_Mprelu3_stage0_L1_0 0=96
Split            splitncnn_46     1 2 Mconv3_stage0_L1_0_Mprelu3_stage0_L1_0 Mconv3_stage0_L1_0_Mprelu3_stage0_L1_0_splitncnn_0 Mconv3_stage0_L1_0_Mprelu3_stage0_L1_0_splitncnn_1
Convolution      Mconv3_stage0_L1_1 1 1 Mconv3_stage0_L1_0_Mprelu3_stage0_L1_0_splitncnn_1 Mconv3_stage0_L1_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu3_stage0_L1_1 1 1 Mconv3_stage0_L1_1 Mconv3_stage0_L1_1_Mprelu3_stage0_L1_1 0=96
Split            splitncnn_47     1 2 Mconv3_stage0_L1_1_Mprelu3_stage0_L1_1 Mconv3_stage0_L1_1_Mprelu3_stage0_L1_1_splitncnn_0 Mconv3_stage0_L1_1_Mprelu3_stage0_L1_1_splitncnn_1
Convolution      Mconv3_stage0_L1_2 1 1 Mconv3_stage0_L1_1_Mprelu3_stage0_L1_1_splitncnn_1 Mconv3_stage0_L1_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu3_stage0_L1_2 1 1 Mconv3_stage0_L1_2 Mconv3_stage0_L1_2_Mprelu3_stage0_L1_2 0=96
Concat           Mconv3_stage0_L1_concat 3 1 Mconv3_stage0_L1_0_Mprelu3_stage0_L1_0_splitncnn_0 Mconv3_stage0_L1_1_Mprelu3_stage0_L1_1_splitncnn_0 Mconv3_stage0_L1_2_Mprelu3_stage0_L1_2 Mconv3_stage0_L1_concat 0=0
Convolution      Mconv4_stage0_L1_0 1 1 Mconv3_stage0_L1_concat Mconv4_stage0_L1_0 0=96 1=3 2=1 3=1 4=1 5=1 6=248832
PReLU            Mprelu4_stage0_L1_0 1 1 Mconv4_stage0_L1_0 Mconv4_stage0_L1_0_Mprelu4_stage0_L1_0 0=96
Split            splitncnn_48     1 2 Mconv4_stage0_L1_0_Mprelu4_stage0_L1_0 Mconv4_stage0_L1_0_Mprelu4_stage0_L1_0_splitncnn_0 Mconv4_stage0_L1_0_Mprelu4_stage0_L1_0_splitncnn_1
Convolution      Mconv4_stage0_L1_1 1 1 Mconv4_stage0_L1_0_Mprelu4_stage0_L1_0_splitncnn_1 Mconv4_stage0_L1_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu4_stage0_L1_1 1 1 Mconv4_stage0_L1_1 Mconv4_stage0_L1_1_Mprelu4_stage0_L1_1 0=96
Split            splitncnn_49     1 2 Mconv4_stage0_L1_1_Mprelu4_stage0_L1_1 Mconv4_stage0_L1_1_Mprelu4_stage0_L1_1_splitncnn_0 Mconv4_stage0_L1_1_Mprelu4_stage0_L1_1_splitncnn_1
Convolution      Mconv4_stage0_L1_2 1 1 Mconv4_stage0_L1_1_Mprelu4_stage0_L1_1_splitncnn_1 Mconv4_stage0_L1_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu4_stage0_L1_2 1 1 Mconv4_stage0_L1_2 Mconv4_stage0_L1_2_Mprelu4_stage0_L1_2 0=96
Concat           Mconv4_stage0_L1_concat 3 1 Mconv4_stage0_L1_0_Mprelu4_stage0_L1_0_splitncnn_0 Mconv4_stage0_L1_1_Mprelu4_stage0_L1_1_splitncnn_0 Mconv4_stage0_L1_2_Mprelu4_stage0_L1_2 Mconv4_stage0_L1_concat 0=0
Convolution      Mconv5_stage0_L1_0 1 1 Mconv4_stage0_L1_concat Mconv5_stage0_L1_0 0=96 1=3 2=1 3=1 4=1 5=1 6=248832
PReLU            Mprelu5_stage0_L1_0 1 1 Mconv5_stage0_L1_0 Mconv5_stage0_L1_0_Mprelu5_stage0_L1_0 0=96
Split            splitncnn_50     1 2 Mconv5_stage0_L1_0_Mprelu5_stage0_L1_0 Mconv5_stage0_L1_0_Mprelu5_stage0_L1_0_splitncnn_0 Mconv5_stage0_L1_0_Mprelu5_stage0_L1_0_splitncnn_1
Convolution      Mconv5_stage0_L1_1 1 1 Mconv5_stage0_L1_0_Mprelu5_stage0_L1_0_splitncnn_1 Mconv5_stage0_L1_1 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu5_stage0_L1_1 1 1 Mconv5_stage0_L1_1 Mconv5_stage0_L1_1_Mprelu5_stage0_L1_1 0=96
Split            splitncnn_51     1 2 Mconv5_stage0_L1_1_Mprelu5_stage0_L1_1 Mconv5_stage0_L1_1_Mprelu5_stage0_L1_1_splitncnn_0 Mconv5_stage0_L1_1_Mprelu5_stage0_L1_1_splitncnn_1
Convolution      Mconv5_stage0_L1_2 1 1 Mconv5_stage0_L1_1_Mprelu5_stage0_L1_1_splitncnn_1 Mconv5_stage0_L1_2 0=96 1=3 2=1 3=1 4=1 5=1 6=82944
PReLU            Mprelu5_stage0_L1_2 1 1 Mconv5_stage0_L1_2 Mconv5_stage0_L1_2_Mprelu5_stage0_L1_2 0=96
Concat           Mconv5_stage0_L1_concat 3 1 Mconv5_stage0_L1_0_Mprelu5_stage0_L1_0_splitncnn_0 Mconv5_stage0_L1_1_Mprelu5_stage0_L1_1_splitncnn_0 Mconv5_stage0_L1_2_Mprelu5_stage0_L1_2 Mconv5_stage0_L1_concat 0=0
Convolution      Mconv6_stage0_L1 1 1 Mconv5_stage0_L1_concat Mconv6_stage0_L1 0=256 1=1 2=1 3=1 4=0 5=1 6=73728
PReLU            Mprelu6_stage0_L1 1 1 Mconv6_stage0_L1 Mconv6_stage0_L1_Mprelu6_stage0_L1 0=256
Convolution      Mconv7_stage0_L1 1 1 Mconv6_stage0_L1_Mprelu6_stage0_L1 Mconv7_stage0_L1 0=26 1=1 2=1 3=1 4=0 5=1 6=6656
Concat           concat_stage1_L1 3 1 conv4_4_CPM_prelu4_4_CPM_splitncnn_0 Mconv7_stage0_L1 Mconv7_stage3_L2_splitncnn_1 concat_stage1_L1 0=0
Convolution      Mconv1_stage1_L1_0 1 1 concat_stage1_L1 Mconv1_stage1_L1_0 0=128 1=3 2=1 3=1 4=1 5=1 6=237312
PReLU            Mprelu1_stage1_L1_0 1 1 Mconv1_stage1_L1_0 Mconv1_stage1_L1_0_Mprelu1_stage1_L1_0 0=128
Split            splitncnn_52     1 2 Mconv1_stage1_L1_0_Mprelu1_stage1_L1_0 Mconv1_stage1_L1_0_Mprelu1_stage1_L1_0_splitncnn_0 Mconv1_stage1_L1_0_Mprelu1_stage1_L1_0_splitncnn_1
Convolution      Mconv1_stage1_L1_1 1 1 Mconv1_stage1_L1_0_Mprelu1_stage1_L1_0_splitncnn_1 Mconv1_stage1_L1_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu1_stage1_L1_1 1 1 Mconv1_stage1_L1_1 Mconv1_stage1_L1_1_Mprelu1_stage1_L1_1 0=128
Split            splitncnn_53     1 2 Mconv1_stage1_L1_1_Mprelu1_stage1_L1_1 Mconv1_stage1_L1_1_Mprelu1_stage1_L1_1_splitncnn_0 Mconv1_stage1_L1_1_Mprelu1_stage1_L1_1_splitncnn_1
Convolution      Mconv1_stage1_L1_2 1 1 Mconv1_stage1_L1_1_Mprelu1_stage1_L1_1_splitncnn_1 Mconv1_stage1_L1_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu1_stage1_L1_2 1 1 Mconv1_stage1_L1_2 Mconv1_stage1_L1_2_Mprelu1_stage1_L1_2 0=128
Concat           Mconv1_stage1_L1_concat 3 1 Mconv1_stage1_L1_0_Mprelu1_stage1_L1_0_splitncnn_0 Mconv1_stage1_L1_1_Mprelu1_stage1_L1_1_splitncnn_0 Mconv1_stage1_L1_2_Mprelu1_stage1_L1_2 Mconv1_stage1_L1_concat 0=0
Convolution      Mconv2_stage1_L1_0 1 1 Mconv1_stage1_L1_concat Mconv2_stage1_L1_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu2_stage1_L1_0 1 1 Mconv2_stage1_L1_0 Mconv2_stage1_L1_0_Mprelu2_stage1_L1_0 0=128
Split            splitncnn_54     1 2 Mconv2_stage1_L1_0_Mprelu2_stage1_L1_0 Mconv2_stage1_L1_0_Mprelu2_stage1_L1_0_splitncnn_0 Mconv2_stage1_L1_0_Mprelu2_stage1_L1_0_splitncnn_1
Convolution      Mconv2_stage1_L1_1 1 1 Mconv2_stage1_L1_0_Mprelu2_stage1_L1_0_splitncnn_1 Mconv2_stage1_L1_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu2_stage1_L1_1 1 1 Mconv2_stage1_L1_1 Mconv2_stage1_L1_1_Mprelu2_stage1_L1_1 0=128
Split            splitncnn_55     1 2 Mconv2_stage1_L1_1_Mprelu2_stage1_L1_1 Mconv2_stage1_L1_1_Mprelu2_stage1_L1_1_splitncnn_0 Mconv2_stage1_L1_1_Mprelu2_stage1_L1_1_splitncnn_1
Convolution      Mconv2_stage1_L1_2 1 1 Mconv2_stage1_L1_1_Mprelu2_stage1_L1_1_splitncnn_1 Mconv2_stage1_L1_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu2_stage1_L1_2 1 1 Mconv2_stage1_L1_2 Mconv2_stage1_L1_2_Mprelu2_stage1_L1_2 0=128
Concat           Mconv2_stage1_L1_concat 3 1 Mconv2_stage1_L1_0_Mprelu2_stage1_L1_0_splitncnn_0 Mconv2_stage1_L1_1_Mprelu2_stage1_L1_1_splitncnn_0 Mconv2_stage1_L1_2_Mprelu2_stage1_L1_2 Mconv2_stage1_L1_concat 0=0
Convolution      Mconv3_stage1_L1_0 1 1 Mconv2_stage1_L1_concat Mconv3_stage1_L1_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu3_stage1_L1_0 1 1 Mconv3_stage1_L1_0 Mconv3_stage1_L1_0_Mprelu3_stage1_L1_0 0=128
Split            splitncnn_56     1 2 Mconv3_stage1_L1_0_Mprelu3_stage1_L1_0 Mconv3_stage1_L1_0_Mprelu3_stage1_L1_0_splitncnn_0 Mconv3_stage1_L1_0_Mprelu3_stage1_L1_0_splitncnn_1
Convolution      Mconv3_stage1_L1_1 1 1 Mconv3_stage1_L1_0_Mprelu3_stage1_L1_0_splitncnn_1 Mconv3_stage1_L1_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu3_stage1_L1_1 1 1 Mconv3_stage1_L1_1 Mconv3_stage1_L1_1_Mprelu3_stage1_L1_1 0=128
Split            splitncnn_57     1 2 Mconv3_stage1_L1_1_Mprelu3_stage1_L1_1 Mconv3_stage1_L1_1_Mprelu3_stage1_L1_1_splitncnn_0 Mconv3_stage1_L1_1_Mprelu3_stage1_L1_1_splitncnn_1
Convolution      Mconv3_stage1_L1_2 1 1 Mconv3_stage1_L1_1_Mprelu3_stage1_L1_1_splitncnn_1 Mconv3_stage1_L1_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu3_stage1_L1_2 1 1 Mconv3_stage1_L1_2 Mconv3_stage1_L1_2_Mprelu3_stage1_L1_2 0=128
Concat           Mconv3_stage1_L1_concat 3 1 Mconv3_stage1_L1_0_Mprelu3_stage1_L1_0_splitncnn_0 Mconv3_stage1_L1_1_Mprelu3_stage1_L1_1_splitncnn_0 Mconv3_stage1_L1_2_Mprelu3_stage1_L1_2 Mconv3_stage1_L1_concat 0=0
Convolution      Mconv4_stage1_L1_0 1 1 Mconv3_stage1_L1_concat Mconv4_stage1_L1_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu4_stage1_L1_0 1 1 Mconv4_stage1_L1_0 Mconv4_stage1_L1_0_Mprelu4_stage1_L1_0 0=128
Split            splitncnn_58     1 2 Mconv4_stage1_L1_0_Mprelu4_stage1_L1_0 Mconv4_stage1_L1_0_Mprelu4_stage1_L1_0_splitncnn_0 Mconv4_stage1_L1_0_Mprelu4_stage1_L1_0_splitncnn_1
Convolution      Mconv4_stage1_L1_1 1 1 Mconv4_stage1_L1_0_Mprelu4_stage1_L1_0_splitncnn_1 Mconv4_stage1_L1_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu4_stage1_L1_1 1 1 Mconv4_stage1_L1_1 Mconv4_stage1_L1_1_Mprelu4_stage1_L1_1 0=128
Split            splitncnn_59     1 2 Mconv4_stage1_L1_1_Mprelu4_stage1_L1_1 Mconv4_stage1_L1_1_Mprelu4_stage1_L1_1_splitncnn_0 Mconv4_stage1_L1_1_Mprelu4_stage1_L1_1_splitncnn_1
Convolution      Mconv4_stage1_L1_2 1 1 Mconv4_stage1_L1_1_Mprelu4_stage1_L1_1_splitncnn_1 Mconv4_stage1_L1_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu4_stage1_L1_2 1 1 Mconv4_stage1_L1_2 Mconv4_stage1_L1_2_Mprelu4_stage1_L1_2 0=128
Concat           Mconv4_stage1_L1_concat 3 1 Mconv4_stage1_L1_0_Mprelu4_stage1_L1_0_splitncnn_0 Mconv4_stage1_L1_1_Mprelu4_stage1_L1_1_splitncnn_0 Mconv4_stage1_L1_2_Mprelu4_stage1_L1_2 Mconv4_stage1_L1_concat 0=0
Convolution      Mconv5_stage1_L1_0 1 1 Mconv4_stage1_L1_concat Mconv5_stage1_L1_0 0=128 1=3 2=1 3=1 4=1 5=1 6=442368
PReLU            Mprelu5_stage1_L1_0 1 1 Mconv5_stage1_L1_0 Mconv5_stage1_L1_0_Mprelu5_stage1_L1_0 0=128
Split            splitncnn_60     1 2 Mconv5_stage1_L1_0_Mprelu5_stage1_L1_0 Mconv5_stage1_L1_0_Mprelu5_stage1_L1_0_splitncnn_0 Mconv5_stage1_L1_0_Mprelu5_stage1_L1_0_splitncnn_1
Convolution      Mconv5_stage1_L1_1 1 1 Mconv5_stage1_L1_0_Mprelu5_stage1_L1_0_splitncnn_1 Mconv5_stage1_L1_1 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu5_stage1_L1_1 1 1 Mconv5_stage1_L1_1 Mconv5_stage1_L1_1_Mprelu5_stage1_L1_1 0=128
Split            splitncnn_61     1 2 Mconv5_stage1_L1_1_Mprelu5_stage1_L1_1 Mconv5_stage1_L1_1_Mprelu5_stage1_L1_1_splitncnn_0 Mconv5_stage1_L1_1_Mprelu5_stage1_L1_1_splitncnn_1
Convolution      Mconv5_stage1_L1_2 1 1 Mconv5_stage1_L1_1_Mprelu5_stage1_L1_1_splitncnn_1 Mconv5_stage1_L1_2 0=128 1=3 2=1 3=1 4=1 5=1 6=147456
PReLU            Mprelu5_stage1_L1_2 1 1 Mconv5_stage1_L1_2 Mconv5_stage1_L1_2_Mprelu5_stage1_L1_2 0=128
Concat           Mconv5_stage1_L1_concat 3 1 Mconv5_stage1_L1_0_Mprelu5_stage1_L1_0_splitncnn_0 Mconv5_stage1_L1_1_Mprelu5_stage1_L1_1_splitncnn_0 Mconv5_stage1_L1_2_Mprelu5_stage1_L1_2 Mconv5_stage1_L1_concat 0=0
Convolution      Mconv6_stage1_L1 1 1 Mconv5_stage1_L1_concat Mconv6_stage1_L1 0=512 1=1 2=1 3=1 4=0 5=1 6=196608
PReLU            Mprelu6_stage1_L1 1 1 Mconv6_stage1_L1 Mconv6_stage1_L1_Mprelu6_stage1_L1 0=512
Convolution      Mconv7_stage1_L1 1 1 Mconv6_stage1_L1_Mprelu6_stage1_L1 Mconv7_stage1_L1 0=26 1=1 2=1 3=1 4=0 5=1 6=13312
Concat           net_output       2 1 Mconv7_stage1_L1 Mconv7_stage3_L2_splitncnn_0 net_output 0=0
